"""
5 5
1 2 3 4 5
5 4 3 2 1
2 3 4 5 6
6 5 4 3 2
1 2 1 2 1

"""
# 매핑 테이블 만들기
table = [
    [(1, 0), (2, 0), (3, 0)],
    [(0, 1), (1, 0), (2, 0)],
    [(1, 0), (1, 1), (2, 0)],
    [(1, 0), (2, 0), (2, 1)],
    [(0, 1), (1, 1), (2, 1)],
    [(1, 0), (1, -1), (2, 0)],
    [(1, 0), (2, 0), (2, -1)],
    [(0, 1), (0, 2), (0, 3)],
    [(0, 1), (0, 2), (1, 0)],
    [(0, 1), (0, 2), (1, 1)],
    [(0, 1), (0, 2), (1, 2)],
    [(1, 0), (1, 1), (1, 2)],
    [(1, -1), (1, 0), (1, 1)],
    [(1, 0), (1, -1), (1, -2)],
    [(0, 1), (1, 1), (1, 0)],
    [(0, 1), (-1, 1), (-1, 2)],
    [(0, 1), (1, 1), (1, 2)],
    [(1, 0), (1, 1), (2, 1)],
    [(1, 0), (1, -1), (2, -1)]
]


N, M = map(int, input().split())
arr = [list(map(int, input().split())) for _ in range(N)]
max_result = 0

for i in range(N):
    for j in range(M):
        # 모양 하나씩 다 탐색
        for shape in table:
            cnt_sum = arr[i][j]     # 현재 값 미리 넣어두기
            for k in range(3):      # 나머지 정사각형 3개 고려
                ni, nj = i+shape[k][0], j+shape[k][1]
                if 0 <= ni < N and 0 <= nj < M:
                    cnt_sum += arr[ni][nj]
            if cnt_sum > max_result:
                max_result = cnt_sum
print(max_result)
